---
kind: type
id: T:Autodesk.Revit.DB.ShapeImporter
source: html/d6120e08-f260-577d-b6cf-3fe5b042a54e.htm
---
# Autodesk.Revit.DB.ShapeImporter

A utility class that supports conversion of geometry stored in an external format into a Revit geometry objects.

## Syntax (C#)
```csharp
public class ShapeImporter : IDisposable
```

## Remarks
See ShapeImporterSourceFormat for the list of supported formats.